app/views/users/_form.html.erb

SELECT "messages"."id" FROM "messages"  ORDER BY id
---
      <ul>
      <% @user.errors.full_messages.each do |message| %>