app/controllers/a_messages_controller.rb

SELECT "a_messages".* FROM "a_messages"
---
  def index
    @a_messages = AMessage.all

INSERT INTO "a_messages" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "message2"], ["created_at", "2016-06-04 15:59:25.001411"], ["updated_at", "2016-06-04 15:59:25.001411"]]
---
  def create
    @a_message = AMessage.new(a_message_params)

    respond_to do |format|
      if @a_message.save

SELECT  "a_messages".* FROM "a_messages" WHERE "a_messages"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_a_message
      @a_message = AMessage.find(params[:id])