app/controllers/users_controller.rb

  def index
    @users = User.all.order(id: :ASC)
---
SELECT "users".* FROM "users"  ORDER BY "users"."id" ASC

  def show
    @histories = @user.histories.order(created_at: :DESC)
---
SELECT "histories".* FROM "histories" WHERE "histories"."user_id" = $1  ORDER BY "histories"."created_at" DESC  [["user_id", 1]]

  def create
    @user = User.new(user_params)

    @user.phone = PhonyRails.normalize_number(params[:user][:phone], :country_code => 'US')
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("phone", "active", "language", "next_message", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["phone", "+13456789012"], ["active", "t"], ["language", "English"], ["next_message", 1], ["score", 3], ["created_at", "2016-06-04 16:14:36.160202"], ["updated_at", "2016-06-04 16:14:36.160202"]]

  def update
    @user.update(user_params)
---
UPDATE "users" SET "next_message" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["next_message", 1], ["updated_at", "2016-06-04 14:55:30.487513"], ["id", 1]]

  def reply
    logger.debug "inside reply function"
    sender = params[:From]
    user = User.find_by(:phone => sender)
---
SELECT  "users".* FROM "users" WHERE "users"."phone" IS NULL LIMIT 1